src/Documents/СогласиеНаОбработкуПерсональныхДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>СогласиеНаОбработкуПерсональныхДанных</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СубъектПерсональныхДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСогласия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/СогласиеНаОбработкуПерсональныхДанных/Forms/ФормаДокументаДляСотрудника/Ext/Form/Module.bsl
#Область ПрикладныеФункцииИПроцедуры
&НаСервере
Процедура ЗаполнитьТекстом()
	Элементы.ТекстСогласия.Заголовок = "Я, " + Объект.СубъектПерсональныхДанных.ПолноеИмя
									 + ", серия паспорта " + Объект.СубъектПерсональныхДанных.СерияПаспорта
									 + ", номер паспорта " + Объект.СубъектПерсональныхДанных.НомерПаспорта
									 + ", выдан " + Объект.СубъектПерсональныхДанных.ПаспортКемВыдан
									 + ", " + Объект.СубъектПерсональныхДанных.ПаспортКогдаВыдан
									 + ", адрес регистрации: " + Объект.СубъектПерсональныхДанных.АдресРегистрации + ", ";
									 
	Если Объект.ТекстСогласия = "" Тогда
		Элементы.ТекстСогласия.Заголовок = Элементы.ТекстСогласия.Заголовок
										 + Константы.ТекстСогласияНаОбработкуПерсональныхДанных.Получить();
	Иначе
		Элементы.ТекстСогласия.Заголовок = Элементы.ТекстСогласия.Заголовок
										 + Объект.ТекстСогласия;
	КонецЕсли;
КонецПроцедуры                   

&НаСервере
Процедура СкрытьТекст()
	Элементы.ГруппаТекстСоглашения.Видимость = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПоказатьТекст()
	ЗаполнитьТекстом();
	Элементы.ГруппаТекстСоглашения.Видимость = Истина;
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьТекста()
	Если Объект.СубъектПерсональныхДанных.Пустая() Тогда
		СкрытьТекст();
	Иначе
		ПоказатьТекст();
	КонецЕсли;
КонецПроцедуры

Процедура ОбновитьДоступностьФормы()
	ЭтаФорма.ТолькоПросмотр = Истина;
	ЭтаФорма.КоманднаяПанель.Доступность = Не Объект.Подписан;
КонецПроцедуры
#КонецОбласти                    

#Область ОбработчикиСобытий
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимостьТекста(); 
	ОбновитьДоступностьФормы();
КонецПроцедуры

&НаКлиенте
Процедура СубъектПерсональныхДанныхПриИзменении(Элемент)
	ОбновитьВидимостьТекста();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ТекстСогласия = Элементы.ТекстСогласия.Заголовок;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СубъектПерсональныхДанных") Тогда
		Объект.СубъектПерсональныхДанных = Параметры.СубъектПерсональныхДанных;
	КонецЕсли;
	
	ОбновитьВидимостьТекста();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
    ДобавитьВЛичныйКабинет();
КонецПроцедуры

&НаКлиенте
Процедура ПоставитьПодпись()
	Объект.Подписан = Истина;
КонецПроцедуры

&НаСервере
Процедура ДобавитьВЛичныйКабинет()
	Сотрудник = Объект.СубъектПерсональныхДанных.ПолучитьОбъект();
	Попытка
		Сотрудник.Заблокировать();
		Сотрудник.СогласиеНаОбработкуПД = Объект.Ссылка;
		Сотрудник.Записать();
		Сотрудник.Разблокировать();
	Исключение
		Сообщить("Объект сейчас используется. Попробуйте позже.", СтатусСообщения.Важное);
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокумент()
	ПараметрыЗаписи = Новый Структура("РежимЗаписи, Закрыть", РежимЗаписиДокумента.Проведение, Ложь);
	Записать(ПараметрыЗаписи);
КонецПроцедуры

&НаКлиенте
Процедура КнопкаПодписать(Команда)
	ПоставитьПодпись();
	ПровестиДокумент();
	ОбновитьДоступностьФормы();
КонецПроцедуры     

&НаКлиенте
Процедура КнопкаПодписатьИЗакрыть(Команда)
	ПоставитьПодпись();
	ПровестиДокумент();
	Закрыть();
КонецПроцедуры
#КонецОбласти
